In [1]:
import pandas as pd
import sqlalchemy

In [2]:
engine = sqlalchemy.create_engine("mysql+mysqldb://vbo_user:VBo*kmfd8(06@192.168.206.140/vbo")

In [28]:
with engine.connect() as conn:
    conn.execute("""
    TRUNCATE TABLE staff;
    """)

In [29]:
with engine.connect() as conn:
    conn.execute("""
    CREATE TABLE IF NOT EXISTS staff (id int primary key, name_surname varchar(255), section varchar(50));
    """)
    
    try:
        query="INSERT INTO `vbo`.`staff` (`id` ,`name_surname` ,`section`)  VALUES(%s,%s,%s)"
        my_data=[(1416, "Tuncay Avcı", "9. Section"), 
                                            (1417, "İsmail İçtüzer", "9. Section"),
                                            (1506, "Mustafa Aslan", "11. Section"),
                                            (1527, "Buket Durmuş", "11. Section"),
                                            (1525, "Saadet Yılmaz", "11. Section")]

        id=conn.execute(query, my_data)

        print("Rows Added  = ", id.rowcount)
    
    except:
        print("Database error ")

Rows Added  =  5

In [30]:
new_customers = pd.DataFrame(data=
[(1416, "Tuncay Avcı", "11. Section"), 
(1417, "İsmail İçtüzer", "11. Section"),
(1508, "Mustafa Bankur", "11. Section"),
(1522, "Meliha Kaya", "11. Section"),
(1525, "Saadet Yılmaz", "17. Section")],
    columns=['id' ,'name_surname' ,'section']
)

In [31]:
new_customers.head()

     id    name_surname      section
0  1416     Tuncay Avcı  11. Section
1  1417  İsmail İçtüzer  11. Section
2  1508  Mustafa Bankur  11. Section
3  1522     Meliha Kaya  11. Section
4  1525   Saadet Yılmaz  17. Section

In [32]:
existing_customers = pd.read_sql('staff', engine)

In [33]:
existing_customers.head()

     id    name_surname      section
0  1416     Tuncay Avcı   9. Section
1  1417  İsmail İçtüzer   9. Section
2  1506   Mustafa Aslan  11. Section
3  1525   Saadet Yılmaz  11. Section
4  1527    Buket Durmuş  11. Section

In [34]:
insert_ids = set(new_customers.id.to_list()).difference(set(existing_customers.id.to_list()))

In [35]:
print(insert_ids)

{1522, 1508}

In [36]:
insert_df = new_customers[ new_customers['id'].isin(insert_ids) ]

insert_df.head()

     id    name_surname      section
2  1508  Mustafa Bankur  11. Section
3  1522     Meliha Kaya  11. Section

In [37]:
update_ids = set(new_customers.id.to_list()).intersection(set(existing_customers.id.to_list()))

In [38]:
print(update_ids)

{1416, 1417, 1525}

In [39]:
update_df = new_customers[ new_customers['id'].isin(update_ids) ]

update_df.head()

     id    name_surname      section
0  1416     Tuncay Avcı  11. Section
1  1417  İsmail İçtüzer  11. Section
4  1525   Saadet Yılmaz  17. Section

In [40]:
delete_ids = set(existing_customers.id.to_list()).difference(set(new_customers.id.to_list()))

In [41]:
print(delete_ids)

{1506, 1527}

In [42]:
delete_df = existing_customers[ existing_customers['id'].isin(delete_ids) ]

delete_df.head()

     id   name_surname      section
2  1506  Mustafa Aslan  11. Section
4  1527   Buket Durmuş  11. Section

In [43]:
insert_df.to_sql('tmp_insert_table', engine, if_exists='replace', index=False)

update_df.to_sql('tmp_update_table', engine, if_exists='replace', index=False)

delete_df.to_sql('tmp_delete_table', engine, if_exists='replace', index=False)

In [44]:
# To use transaction close autocommit
engine.execution_options(autocommit=False)
with engine.connect() as conn:
    with conn.begin():
        # 1. Insert
        conn.execute(
            "INSERT INTO staff SELECT * FROM tmp_insert_table ;"
        )

        # 2. Update 
        conn.execute(
            """
            UPDATE staff s
            INNER JOIN tmp_update_table u ON s.id = u.id
            SET  s.name_surname = u.name_surname,
                 s.section = u.section
            WHERE s.id = u.id;
            """
        )

        # 3. Delete
        conn.execute("""
            DELETE FROM staff s
            WHERE s.id IN (SELECT id from tmp_delete_table); 
            """)

In [45]:
final_df = pd.read_sql_table('staff', engine)

In [46]:
final_df.head()

     id    name_surname      section
0  1416     Tuncay Avcı  11. Section
1  1417  İsmail İçtüzer  11. Section
2  1508  Mustafa Bankur  11. Section
3  1522     Meliha Kaya  11. Section
4  1525   Saadet Yılmaz  17. Section